# RbsConnectorOffsetObsolete Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsConnectorOffsetObsolete Property
ParameterTypeId Class See Also
---
"Connector Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsConnectorOffsetObsolete { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsConnectorOffsetObsolete As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsConnectorOffsetObsolete {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace